/*************************************************************************
【文件名】Face3D.hpp
【功能模块和目的】定义Face3D类，继承自CountFixedElement3D类，表示三维空间中的面
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
#ifndef FACE3D_HPP
#define FACE3D_HPP

// CountFixedElement3D所属头文件
#include "CountFixedElement3D.hpp"
// Point3D所属头文件
#include "Point3D.hpp"

/*************************************************************************
【类名】Face3D
【功能】定义Face3D类，表示三维空间中的面
【接口说明】
    默认构造函数
    带参构造函数
    拷贝构造函数
    重载赋值运算符
    虚析构函数
    计算面积
    计算周长
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
class Face3D : public CountFixedElement3D {
public:
    //-------------------------------------------------------------------------
    // 必要的构造、析构、拷贝、赋值运算符重载函数
    //-------------------------------------------------------------------------
    // 默认构造函数
    Face3D();
    // 带参构造函数
    Face3D(
        const Point3D& Point1, 
        const Point3D& Point2, 
        const Point3D& Point3);
    // 拷贝构造函数
    Face3D(const Face3D& Source);
    // 重载赋值运算符
    Face3D& operator=(const Face3D& Source);
    // 虚析构函数
    virtual ~Face3D() = default;
    //-------------------------------------------------------------------------
    // 非静态Getter成员函数
    //-------------------------------------------------------------------------
    // 重载基类的计算面积函数
    double Area() const override;
    // 重载基类的计算周长函数
    double Length() const override;
};

#endif /* Face3D.hpp */