/*************************************************************************
【文件名】Line3D.cpp
【功能模块和目的】定义Line3D类的成员函数
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/

// Line3D所属头文件
#include "Line3D.hpp"
// Point3D所属头文件
#include "Point3D.hpp"
// CountFixedElement3D所属头文件
#include "CountFixedElement3D.hpp"

using namespace std;

//-------------------------------------------------------------------------
// 必要的构造、析构、拷贝、赋值运算符重载函数
//-------------------------------------------------------------------------

/*************************************************************************
【函数名称】Line3D
【函数功能】默认构造函数，用于初始化Line3D类的对象
【参数】无
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Line3D::Line3D() : CountFixedElement3D(2) { // 2表示线的点数为2
}  
/*************************************************************************
【函数名称】Line3D
【函数功能】带参构造函数，用于初始化Line3D类的对象
【参数】const Point3D& Point1, const Point3D& Point2
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Line3D::Line3D(const Point3D& Point1, const Point3D& Point2)
    : CountFixedElement3D({Point1, Point2}, 2) {  // 2表示线的点数为2
    }
/*************************************************************************
【函数名称】Line3D
【函数功能】拷贝构造函数，用于初始化Line3D类的对象
【参数】const Line3D& Source, 表示另一个Line3D类的对象
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Line3D::Line3D(const Line3D& Source) : CountFixedElement3D(Source) {
}
/*************************************************************************
【函数名称】operator=
【函数功能】重载赋值运算符，用于将一个Line3D类的对象赋值给另一个Line3D类的对象
【参数】const Line3D& Source, 表示另一个Line3D类的对象
【返回值】Line3D类的对象的引用
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Line3D& Line3D::operator=(const Line3D& Source) {
    if (this != &Source) {
        CountFixedElement3D::operator=(Source);
    }
    return *this;
}
/*************************************************************************
【函数名称】Length
【函数功能】计算线的长度
【参数】无
【返回值】double类型，表示线的长度
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
double Line3D::Length() const { 
    return Points[0].Distance(Points[1]); 
}
/*************************************************************************
【函数名称】Area
【函数功能】线的面积为0，故返回0
【参数】无
【返回值】double类型，返回0
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
double Line3D::Area() const { 
    return 0; 
}