/*************************************************************************
【文件名】Point3DSet.hpp
【功能模块和目的】定义Point3DSet类，表示三维空间中的点集合
【开发者及日期】谭雯心 2024/8/11
【更改记录】
*************************************************************************/
#ifndef POINT3DSET_HPP
#define POINT3DSET_HPP

// Set所属头文件
#include "Set.hpp"
// Point3D所属头文件
#include "Point3D.hpp"

/*************************************************************************
【类名】Point3DSet
【功能】定义Point3DSet类，表示三维空间中的点集合
【接口说明】可直接访问Set<Point3D>类的所有接口
【开发者及日期】谭雯心 2024/8/11
【更改记录】
*************************************************************************/
using Point3DSet = Set<Point3D>;

#endif /* Point3DSet.hpp */