/*************************************************************************
【文件名】Point3D.cpp
【功能模块和目的】定义Point3D类，继承自Vector3D类，表示三维空间中的点
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
// Point3D类头文件
#include "Point3D.hpp"
// pow, sqrt所属头文件
#include <cmath>

using namespace std;

//-------------------------------------------------------------------------
// 必要的构造、析构、拷贝、赋值运算符重载函数
//-------------------------------------------------------------------------

/*************************************************************************
【函数名称】Point3D
【函数功能】带参构造函数，用于初始化Point3D类的对象
【参数】double x, double y, double z, 分别表示点的X, Y, Z坐标
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Point3D::Point3D(double x, double y, double z) : Vector3D<double>({x, y, z}) {
}
/*************************************************************************
【函数名称】Point3D
【函数功能】拷贝构造函数，用于初始化Point3D类的对象
【参数】const Point3D& APoint, 表示另一个Point3D类的对象
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Point3D::Point3D(const Point3D& APoint) : Vector3D<double>(APoint) {
}
/*************************************************************************
【函数名称】operator=
【函数功能】重载赋值运算符，用于将一个Point3D类的对象赋值给另一个Point3D类的对象
【参数】const Point3D& APoint, 表示另一个Point3D类的对象
【返回值】Point3D类的对象的引用
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
Point3D& Point3D::operator=(const Point3D& APoint) {
    if (this == &APoint) {
        return *this;
    }
    Vector3D<double>::operator=(APoint);
    return *this;
}

//-------------------------------------------------------------------------
// 非静态Getter成员函数
//-------------------------------------------------------------------------

/*************************************************************************
【函数名称】Distance const
【函数功能】计算两点间的距离
【参数】const Point3D& APoint, 表示另一个Point3D类的对象
【返回值】double类型，表示两点间的距离
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
double Point3D::Distance(const Point3D& APoint) const {
    return sqrt(pow(X - APoint.X, 2)
        + pow(Y - APoint.Y, 2) + pow(Z - APoint.Z, 2));
}

//-------------------------------------------------------------------------
// 非静态Setter成员函数
//-------------------------------------------------------------------------

/*************************************************************************
【函数名称】SetX
【函数功能】设置X坐标
【参数】double x, 表示X坐标
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
void Point3D::SetX(double x) {
    SetVector(0, x);
}
/*************************************************************************
【函数名称】SetY
【函数功能】设置Y坐标
【参数】double y, 表示Y坐标
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
void Point3D::SetY(double y) {
    SetVector(1, y);
}
/*************************************************************************
【函数名称】SetZ
【函数功能】设置Z坐标
【参数】double z, 表示Z坐标
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
void Point3D::SetZ(double z) {
    SetVector(2, z);
}
/*************************************************************************
【函数名称】Set
【函数功能】设置X, Y, Z坐标
【参数】double x, double y, double z, 分别表示X, Y, Z坐标
【返回值】无
【开发者及日期】谭雯心 2024/8/5
【更改记录】
*************************************************************************/
void Point3D::Set(double x, double y, double z) {
    SetX(x);
    SetY(y);
    SetZ(z);
}